test/autocannon-07.txt
autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ]  http://localhost:3000/cars
Running 2s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

\
┌─────────┬────────┬────────┬──────────┬──────────┬────────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%    │ 99%      │ Avg        │ Stdev      │ Max      │
├─────────┼────────┼────────┼──────────┼──────────┼────────────┼────────────┼──────────┤
│ Latency │ 378 ms │ 873 ms │ 14174 ms │ 16256 ms │ 2632.99 ms │ 3688.15 ms │ 18473 ms │
└─────────┴────────┴────────┴──────────┴──────────┴────────────┴────────────┴──────────┘
┌───────────┬─────────┬─────────┬────────┬────────┬────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼─────────┼─────────┤
│ Req/Sec   │ 295     │ 295     │ 550    │ 914    │ 615,96 │ 171,63  │ 295     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼─────────┼─────────┤
│ Bytes/Sec │ 69.4 kB │ 69.4 kB │ 129 kB │ 215 kB │ 145 kB │ 40.3 kB │ 69.3 kB │
└───────────┴─────────┴─────────┴────────┴────────┴────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 12319 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 126          │
├────────────┼──────────────┤
│ 0.01       │ 126          │
├────────────┼──────────────┤
│ 0.1        │ 127          │
├────────────┼──────────────┤
│ 1          │ 289          │
├────────────┼──────────────┤
│ 2.5        │ 378          │
├────────────┼──────────────┤
│ 10         │ 561          │
├────────────┼──────────────┤
│ 25         │ 665          │
├────────────┼──────────────┤
│ 50         │ 873          │
├────────────┼──────────────┤
│ 75         │ 2677         │
├────────────┼──────────────┤
│ 90         │ 8371         │
├────────────┼──────────────┤
│ 97.5       │ 14174        │
├────────────┼──────────────┤
│ 99         │ 16256        │
├────────────┼──────────────┤
│ 99.9       │ 18263        │
├────────────┼──────────────┤
│ 99.99      │ 18449        │
├────────────┼──────────────┤
│ 99.999     │ 18473        │
└────────────┴──────────────┘

15k requests in 20.21s, 2.89 MB read
2k errors (0 timeouts)