test/autocannon-08.txt
autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ]  http://localhost:3000/cars
Running 2s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

|
┌─────────┬────────┬────────┬──────────┬──────────┬───────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%    │ 99%      │ Avg       │ Stdev      │ Max      │
├─────────┼────────┼────────┼──────────┼──────────┼───────────┼────────────┼──────────┤
│ Latency │ 316 ms │ 754 ms │ 12758 ms │ 16125 ms │ 2297.4 ms │ 3066.32 ms │ 19239 ms │
└─────────┴────────┴────────┴──────────┴──────────┴───────────┴────────────┴──────────┘
┌───────────┬─────────┬─────────┬────────┬────────┬────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%    │ 97.5%  │ Avg    │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼────────┼─────────┤
│ Req/Sec   │ 271     │ 271     │ 766    │ 954    │ 681,9  │ 195,59 │ 271     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼────────┼─────────┤
│ Bytes/Sec │ 63.7 kB │ 63.7 kB │ 180 kB │ 224 kB │ 160 kB │ 46 kB  │ 63.7 kB │
└───────────┴─────────┴─────────┴────────┴────────┴────────┴────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 13638 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 127          │
├────────────┼──────────────┤
│ 0.01       │ 140          │
├────────────┼──────────────┤
│ 0.1        │ 222          │
├────────────┼──────────────┤
│ 1          │ 280          │
├────────────┼──────────────┤
│ 2.5        │ 316          │
├────────────┼──────────────┤
│ 10         │ 476          │
├────────────┼──────────────┤
│ 25         │ 648          │
├────────────┼──────────────┤
│ 50         │ 754          │
├────────────┼──────────────┤
│ 75         │ 2810         │
├────────────┼──────────────┤
│ 90         │ 6004         │
├────────────┼──────────────┤
│ 97.5       │ 12758        │
├────────────┼──────────────┤
│ 99         │ 16125        │
├────────────┼──────────────┤
│ 99.9       │ 18362        │
├────────────┼──────────────┤
│ 99.99      │ 18832        │
├────────────┼──────────────┤
│ 99.999     │ 19239        │
└────────────┴──────────────┘

16k requests in 20.19s, 3.2 MB read
2k errors (0 timeouts)