test/autocannon-09.txt
autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ]  http://localhost:3000/cars
Running 2s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

/
┌─────────┬────────┬────────┬──────────┬──────────┬────────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%    │ 99%      │ Avg        │ Stdev      │ Max      │
├─────────┼────────┼────────┼──────────┼──────────┼────────────┼────────────┼──────────┤
│ Latency │ 336 ms │ 731 ms │ 13193 ms │ 15341 ms │ 2126.57 ms │ 3076.85 ms │ 18840 ms │
└─────────┴────────┴────────┴──────────┴──────────┴────────────┴────────────┴──────────┘
┌───────────┬─────────┬─────────┬────────┬────────┬────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%    │ 97.5%  │ Avg    │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼────────┼─────────┤
│ Req/Sec   │ 344     │ 344     │ 718    │ 882    │ 705,85 │ 131,81 │ 344     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼────────┼─────────┤
│ Bytes/Sec │ 80.9 kB │ 80.9 kB │ 169 kB │ 207 kB │ 166 kB │ 31 kB  │ 80.8 kB │
└───────────┴─────────┴─────────┴────────┴────────┴────────┴────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 14117 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 71           │
├────────────┼──────────────┤
│ 0.01       │ 74           │
├────────────┼──────────────┤
│ 0.1        │ 150          │
├────────────┼──────────────┤
│ 1          │ 284          │
├────────────┼──────────────┤
│ 2.5        │ 336          │
├────────────┼──────────────┤
│ 10         │ 513          │
├────────────┼──────────────┤
│ 25         │ 643          │
├────────────┼──────────────┤
│ 50         │ 731          │
├────────────┼──────────────┤
│ 75         │ 2511         │
├────────────┼──────────────┤
│ 90         │ 6441         │
├────────────┼──────────────┤
│ 97.5       │ 13193        │
├────────────┼──────────────┤
│ 99         │ 15341        │
├────────────┼──────────────┤
│ 99.9       │ 18613        │
├────────────┼──────────────┤
│ 99.99      │ 18826        │
├────────────┼──────────────┤
│ 99.999     │ 18840        │
└────────────┴──────────────┘

16k requests in 20.23s, 3.32 MB read
2k errors (0 timeouts)