test/autocannon-10.txt
autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ]  http://localhost:3000/cars
Running 2s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

\
┌─────────┬────────┬────────┬──────────┬──────────┬────────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%    │ 99%      │ Avg        │ Stdev      │ Max      │
├─────────┼────────┼────────┼──────────┼──────────┼────────────┼────────────┼──────────┤
│ Latency │ 338 ms │ 724 ms │ 12424 ms │ 14553 ms │ 2047.98 ms │ 3023.91 ms │ 18045 ms │
└─────────┴────────┴────────┴──────────┴──────────┴────────────┴────────────┴──────────┘
┌───────────┬─────────┬─────────┬────────┬────────┬────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼─────────┼─────────┤
│ Req/Sec   │ 179     │ 179     │ 712    │ 902    │ 622,15 │ 222,44  │ 179     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼─────────┼─────────┤
│ Bytes/Sec │ 42.1 kB │ 42.1 kB │ 167 kB │ 212 kB │ 146 kB │ 52.3 kB │ 42.1 kB │
└───────────┴─────────┴─────────┴────────┴────────┴────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 12443 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 193          │
├────────────┼──────────────┤
│ 0.01       │ 195          │
├────────────┼──────────────┤
│ 0.1        │ 204          │
├────────────┼──────────────┤
│ 1          │ 281          │
├────────────┼──────────────┤
│ 2.5        │ 338          │
├────────────┼──────────────┤
│ 10         │ 569          │
├────────────┼──────────────┤
│ 25         │ 655          │
├────────────┼──────────────┤
│ 50         │ 724          │
├────────────┼──────────────┤
│ 75         │ 1447         │
├────────────┼──────────────┤
│ 90         │ 5515         │
├────────────┼──────────────┤
│ 97.5       │ 12424        │
├────────────┼──────────────┤
│ 99         │ 14553        │
├────────────┼──────────────┤
│ 99.9       │ 17822        │
├────────────┼──────────────┤
│ 99.99      │ 18044        │
├────────────┼──────────────┤
│ 99.999     │ 18045        │
└────────────┴──────────────┘

14k requests in 20.25s, 2.92 MB read
1k errors (0 timeouts)